In [5]:
# Create a Series using List
import pandas as pd
a= pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
type(a)

pandas.core.series.Series

In [9]:
# Change the index
b= pd.Series([1,2,3,4], index = ['a','b','c','d'])
b

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
# Create a Series using Dictionary
Dict= {'fruits':['Apple','Banana','Mango'],'count':[10,20,15]}
X= pd.Series(Dict)
X

fruits    [Apple, Banana, Mango]
count               [10, 20, 15]
dtype: object

In [14]:
a[0]

1

In [16]:
b['d']

4

In [17]:
type(b)

pandas.core.series.Series

In [21]:
X['fruits']

['Apple', 'Banana', 'Mango']

In [22]:
# Create a series using numpy array

import numpy as np
v = np.array([10,20,30])
v

array([10, 20, 30])

In [23]:
y= pd.Series(v)
y

0    10
1    20
2    30
dtype: int32

In [27]:
c=pd.Series( v , index= ['a','b','g'])

In [28]:
c

a    10
b    20
g    30
dtype: int32

In [29]:
# Create a Data Frame using List
Data= [1,2,3,4]
df=pd.DataFrame(Data)

In [30]:
df

   0
0  1
1  2
2  3
3  4

In [31]:
# Creating a Data frame using Dictionary
Dict1 = {'fruits':['Apple','Banana','Mango'],'cost':[150,40,100]}
df1= pd.DataFrame(Dict1)
df1

   fruits  cost
0   Apple   150
1  Banana    40
2   Mango   100

In [32]:
# Creating a Data Frame using Series
Series= pd.Series([6,12],index=['a','b'])
df2=pd.DataFrame(Series)
df2

    0
a   6
b  12

In [33]:
# Creating a Data Frame using Numpy array
a=np.random.rand(5,4)
a

array([[0.22827145, 0.8558348 , 0.46201221, 0.58652656],
       [0.29378757, 0.91975527, 0.04774139, 0.87702677],
       [0.94724721, 0.94501499, 0.85988636, 0.11373433],
       [0.31366392, 0.38484101, 0.12854918, 0.92423607],
       [0.85688413, 0.97846005, 0.51037301, 0.99620916]])

In [38]:
df3=pd.DataFrame(a)
df3

          0         1         2         3
0  0.228271  0.855835  0.462012  0.586527
1  0.293788  0.919755  0.047741  0.877027
2  0.947247  0.945015  0.859886  0.113734
3  0.313664  0.384841  0.128549  0.924236
4  0.856884  0.978460  0.510373  0.996209

In [41]:
df4=pd.DataFrame(a,index=['a','b','c','d','e'],columns=['w','x','y','z'])

In [42]:
df4

          w         x         y         z
a  0.228271  0.855835  0.462012  0.586527
b  0.293788  0.919755  0.047741  0.877027
c  0.947247  0.945015  0.859886  0.113734
d  0.313664  0.384841  0.128549  0.924236
e  0.856884  0.978460  0.510373  0.996209

In [43]:
import pandas as pd
player = ['player1','player2','player3']
point = [8,9,6]
title = ['Game1','Game2','Game3']
df1=pd.DataFrame({'Player': player,'Point':point,'Title':title})

    Player  Point  Title
0  player1      8  Game1
1  player2      9  Game2
2  player3      6  Game3

In [45]:
player = ['player1','player5','player6']
power = ['Punch','Kick','Elbow']
title = ['Game1','Game5','Game6']
df2=pd.DataFrame({'Player': player,'Power':power,'Title':title})
df2

    Player  Power  Title
0  player1  Punch  Game1
1  player5   Kick  Game5
2  player6  Elbow  Game6

In [46]:
# Inner Merge
df1.merge(df2,on='Title', how='inner')

  Player_x  Point  Title Player_y  Power
0  player1      8  Game1  player1  Punch

In [47]:
df1.merge(df2,on='Player', how='inner')

    Player  Point Title_x  Power Title_y
0  player1      8   Game1  Punch   Game1

In [48]:
# Left Merge
df1.merge(df2,on='Player', how='right')

    Player  Point Title_x  Power Title_y
0  player1    8.0   Game1  Punch   Game1
1  player5    NaN     NaN   Kick   Game5
2  player6    NaN     NaN  Elbow   Game6

In [49]:
df1.merge(df2,on='Player', how='left')

    Player  Point Title_x  Power Title_y
0  player1      8   Game1  Punch   Game1
1  player2      9   Game2    NaN     NaN
2  player3      6   Game3    NaN     NaN

In [50]:
df1.merge(df2,on='Title', how='left')

  Player_x  Point  Title Player_y  Power
0  player1      8  Game1  player1  Punch
1  player2      9  Game2      NaN    NaN
2  player3      6  Game3      NaN    NaN

In [51]:
df1.merge(df2,on='Title', how='right')

  Player_x  Point  Title Player_y  Power
0  player1    8.0  Game1  player1  Punch
1      NaN    NaN  Game5  player5   Kick
2      NaN    NaN  Game6  player6  Elbow

In [52]:
df1.merge(df2,on='Title', how='outer')

  Player_x  Point  Title Player_y  Power
0  player1    8.0  Game1  player1  Punch
1  player2    9.0  Game2      NaN    NaN
2  player3    6.0  Game3      NaN    NaN
3      NaN    NaN  Game5  player5   Kick
4      NaN    NaN  Game6  player6  Elbow

In [53]:
df1.merge(df2,on='Player', how='outer')

    Player  Point Title_x  Power Title_y
0  player1    8.0   Game1  Punch   Game1
1  player2    9.0   Game2    NaN     NaN
2  player3    6.0   Game3    NaN     NaN
3  player5    NaN     NaN   Kick   Game5
4  player6    NaN     NaN  Elbow   Game6

In [54]:
player = ['player1','player2','player3']
point = [8,9,6]
title = ['Game1','Game2','Game3']
df3=pd.DataFrame({'Player': player,'Point':point,'Title':title},index=['L1','L2','L3'])
df3

     Player  Point  Title
L1  player1      8  Game1
L2  player2      9  Game2
L3  player3      6  Game3

In [64]:
player = ['player1','player5','player6']
power = ['Punch','Kick','Elbow']
title = ['Game1','Game5','Game6']
df4=pd.DataFrame({'Players': player,'Power':power,'Titles':title},index=['L2','L3','L4'])
df4

    Players  Power Titles
L2  player1  Punch  Game1
L3  player5   Kick  Game5
L4  player6  Elbow  Game6

In [65]:
# Inner Join
df3.join(df4, how='inner')

     Player  Point  Title  Players  Power Titles
L2  player2      9  Game2  player1  Punch  Game1
L3  player3      6  Game3  player5   Kick  Game5

In [66]:
df3.join(df4, how = 'left')

     Player  Point  Title  Players  Power Titles
L1  player1      8  Game1      NaN    NaN    NaN
L2  player2      9  Game2  player1  Punch  Game1
L3  player3      6  Game3  player5   Kick  Game5

In [67]:
df3.join(df4, how = 'right')

     Player  Point  Title  Players  Power Titles
L2  player2    9.0  Game2  player1  Punch  Game1
L3  player3    6.0  Game3  player5   Kick  Game5
L4      NaN    NaN    NaN  player6  Elbow  Game6

In [68]:
df3.join(df4, how = 'outer')

     Player  Point  Title  Players  Power Titles
L1  player1    8.0  Game1      NaN    NaN    NaN
L2  player2    9.0  Game2  player1  Punch  Game1
L3  player3    6.0  Game3  player5   Kick  Game5
L4      NaN    NaN    NaN  player6  Elbow  Game6

In [69]:
pd.concat([df3,df4])

     Player  Point  Title  Players  Power Titles
L1  player1    8.0  Game1      NaN    NaN    NaN
L2  player2    9.0  Game2      NaN    NaN    NaN
L3  player3    6.0  Game3      NaN    NaN    NaN
L2      NaN    NaN    NaN  player1  Punch  Game1
L3      NaN    NaN    NaN  player5   Kick  Game5
L4      NaN    NaN    NaN  player6  Elbow  Game6

In [70]:
df3

     Player  Point  Title
L1  player1      8  Game1
L2  player2      9  Game2
L3  player3      6  Game3

In [71]:
a

array([[0.22827145, 0.8558348 , 0.46201221, 0.58652656],
       [0.29378757, 0.91975527, 0.04774139, 0.87702677],
       [0.94724721, 0.94501499, 0.85988636, 0.11373433],
       [0.31366392, 0.38484101, 0.12854918, 0.92423607],
       [0.85688413, 0.97846005, 0.51037301, 0.99620916]])

In [72]:
QW=pd.DataFrame(a)
QW

          0         1         2         3
0  0.228271  0.855835  0.462012  0.586527
1  0.293788  0.919755  0.047741  0.877027
2  0.947247  0.945015  0.859886  0.113734
3  0.313664  0.384841  0.128549  0.924236
4  0.856884  0.978460  0.510373  0.996209

In [73]:
QW.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      float64
 1   1       5 non-null      float64
 2   2       5 non-null      float64
 3   3       5 non-null      float64
dtypes: float64(4)
memory usage: 288.0 bytes

In [74]:
QW.describe()

              0         1         2         3
count  5.000000  5.000000  5.000000  5.000000
mean   0.527971  0.816781  0.401712  0.699547
std    0.344444  0.245604  0.326068  0.362610
min    0.228271  0.384841  0.047741  0.113734
25%    0.293788  0.855835  0.128549  0.586527
50%    0.313664  0.919755  0.462012  0.877027
75%    0.856884  0.945015  0.510373  0.924236
max    0.947247  0.978460  0.859886  0.996209

In [75]:
QW.max()

0    0.947247
1    0.978460
2    0.859886
3    0.996209
dtype: float64

In [76]:
QW.min()

0    0.228271
1    0.384841
2    0.047741
3    0.113734
dtype: float64

In [77]:
QW.count()

0    5
1    5
2    5
3    5
dtype: int64

In [97]:
QW.shape

(5, 4)

In [79]:
QW.head()

          0         1         2         3
0  0.228271  0.855835  0.462012  0.586527
1  0.293788  0.919755  0.047741  0.877027
2  0.947247  0.945015  0.859886  0.113734
3  0.313664  0.384841  0.128549  0.924236
4  0.856884  0.978460  0.510373  0.996209

In [80]:
QW.tail()

          0         1         2         3
0  0.228271  0.855835  0.462012  0.586527
1  0.293788  0.919755  0.047741  0.877027
2  0.947247  0.945015  0.859886  0.113734
3  0.313664  0.384841  0.128549  0.924236
4  0.856884  0.978460  0.510373  0.996209

In [81]:
type(QW)

pandas.core.frame.DataFrame

In [82]:
QW

          0         1         2         3
0  0.228271  0.855835  0.462012  0.586527
1  0.293788  0.919755  0.047741  0.877027
2  0.947247  0.945015  0.859886  0.113734
3  0.313664  0.384841  0.128549  0.924236
4  0.856884  0.978460  0.510373  0.996209

In [84]:
 # how to change the index and columns
QW=pd.DataFrame(a, index=['a','b','c','d','e'], columns=['w','x','y','z'])
QW

          w         x         y         z
a  0.228271  0.855835  0.462012  0.586527
b  0.293788  0.919755  0.047741  0.877027
c  0.947247  0.945015  0.859886  0.113734
d  0.313664  0.384841  0.128549  0.924236
e  0.856884  0.978460  0.510373  0.996209

In [86]:
QW

          w         x         y         z
a  0.228271  0.855835  0.462012  0.586527
b  0.293788  0.919755  0.047741  0.877027
c  0.947247  0.945015  0.859886  0.113734
d  0.313664  0.384841  0.128549  0.924236
e  0.856884  0.978460  0.510373  0.996209

In [87]:
QW.rename(columns={'w':'col1'})

       col1         x         y         z
a  0.228271  0.855835  0.462012  0.586527
b  0.293788  0.919755  0.047741  0.877027
c  0.947247  0.945015  0.859886  0.113734
d  0.313664  0.384841  0.128549  0.924236
e  0.856884  0.978460  0.510373  0.996209

In [88]:
QW.rename(columns={'w':'col1','x':'col2'}) # here the change will be made only to the executed cell actual QW will remain unchanged

       col1      col2         y         z
a  0.228271  0.855835  0.462012  0.586527
b  0.293788  0.919755  0.047741  0.877027
c  0.947247  0.945015  0.859886  0.113734
d  0.313664  0.384841  0.128549  0.924236
e  0.856884  0.978460  0.510373  0.996209

In [89]:
QW

          w         x         y         z
a  0.228271  0.855835  0.462012  0.586527
b  0.293788  0.919755  0.047741  0.877027
c  0.947247  0.945015  0.859886  0.113734
d  0.313664  0.384841  0.128549  0.924236
e  0.856884  0.978460  0.510373  0.996209

In [90]:
QW.rename(columns = {'w':'col1'}, inplace = True)

In [91]:
QW

       col1         x         y         z
a  0.228271  0.855835  0.462012  0.586527
b  0.293788  0.919755  0.047741  0.877027
c  0.947247  0.945015  0.859886  0.113734
d  0.313664  0.384841  0.128549  0.924236
e  0.856884  0.978460  0.510373  0.996209

In [93]:
QW.rename(index={'a':'row1'}, inplace=True)

In [94]:
QW

          col1         x         y         z
row1  0.228271  0.855835  0.462012  0.586527
b     0.293788  0.919755  0.047741  0.877027
c     0.947247  0.945015  0.859886  0.113734
d     0.313664  0.384841  0.128549  0.924236
e     0.856884  0.978460  0.510373  0.996209

In [96]:
QW.shape

(5, 4)

In [99]:
# to fetch a particular column from DataFrame
QW[['x','y']]

             x         y
row1  0.855835  0.462012
b     0.919755  0.047741
c     0.945015  0.859886
d     0.384841  0.128549
e     0.978460  0.510373

In [100]:
QW.columns

Index(['col1', 'x', 'y', 'z'], dtype='object')

In [101]:
QW.index

Index(['row1', 'b', 'c', 'd', 'e'], dtype='object')

In [102]:
QW.drop('x',axis=1,inplace=True)

In [103]:
QW

          col1         y         z
row1  0.228271  0.462012  0.586527
b     0.293788  0.047741  0.877027
c     0.947247  0.859886  0.113734
d     0.313664  0.128549  0.924236
e     0.856884  0.510373  0.996209

In [105]:
QW.drop('b',inplace = True)

In [106]:
QW

          col1         y         z
row1  0.228271  0.462012  0.586527
c     0.947247  0.859886  0.113734
d     0.313664  0.128549  0.924236
e     0.856884  0.510373  0.996209

In [108]:
QW.loc['c']

col1    0.947247
y       0.859886
z       0.113734
Name: c, dtype: float64

In [109]:
QW.loc['c':'e']

       col1         y         z
c  0.947247  0.859886  0.113734
d  0.313664  0.128549  0.924236
e  0.856884  0.510373  0.996209

In [110]:
QW.loc['c':'e','z']

c    0.113734
d    0.924236
e    0.996209
Name: z, dtype: float64

In [1]:
import numpy as np
a=np.random.rand(5,4)
a

array([[0.42179166, 0.15354197, 0.30782945, 0.35249372],
       [0.20029493, 0.55949734, 0.89026497, 0.94686648],
       [0.13968446, 0.75006768, 0.38558431, 0.54264946],
       [0.21440167, 0.8104655 , 0.19676444, 0.57664232],
       [0.99151087, 0.65335215, 0.6008068 , 0.87663277]])

In [2]:
import pandas as pd
QW= pd.DataFrame(a, index= ['a','b','c','d','e'],columns= ['w','x','y','z'])
QW

          w         x         y         z
a  0.421792  0.153542  0.307829  0.352494
b  0.200295  0.559497  0.890265  0.946866
c  0.139684  0.750068  0.385584  0.542649
d  0.214402  0.810465  0.196764  0.576642
e  0.991511  0.653352  0.600807  0.876633

In [3]:
QW.iloc[0:3,1:3]

          x         y
a  0.153542  0.307829
b  0.559497  0.890265
c  0.750068  0.385584

In [4]:
QW.iloc[1,2]

0.8902649675767391

In [5]:
QW.drop(QW.columns[0],axis=1)

          x         y         z
a  0.153542  0.307829  0.352494
b  0.559497  0.890265  0.946866
c  0.750068  0.385584  0.542649
d  0.810465  0.196764  0.576642
e  0.653352  0.600807  0.876633

In [6]:
QW

          w         x         y         z
a  0.421792  0.153542  0.307829  0.352494
b  0.200295  0.559497  0.890265  0.946866
c  0.139684  0.750068  0.385584  0.542649
d  0.214402  0.810465  0.196764  0.576642
e  0.991511  0.653352  0.600807  0.876633

In [7]:
QW.drop('w',axis=1)

          x         y         z
a  0.153542  0.307829  0.352494
b  0.559497  0.890265  0.946866
c  0.750068  0.385584  0.542649
d  0.810465  0.196764  0.576642
e  0.653352  0.600807  0.876633

In [8]:
a= [1,2,3]
b=[4,5,6]
list(zip(a,b))

[(1, 4), (2, 5), (3, 6)]

In [9]:
TV = [1,3,2,1,3,5,np.nan,5,6,1]
Cars= [14,24,19,13,24,25,3,30,35,12]

In [10]:
df=pd.DataFrame(zip(TV,Cars),columns=('TV ads','Car sold'))

In [11]:
df

   TV ads  Car sold
0     1.0        14
1     3.0        24
2     2.0        19
3     1.0        13
4     3.0        24
5     5.0        25
6     NaN         3
7     5.0        30
8     6.0        35
9     1.0        12

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
type(df['TV ads'])

pandas.core.series.Series

In [14]:
df.to_csv('sales.csv') # my data frame converted into csv and it will be stored in current working directory
import os
os.getcwd()

'C:\\Users\\lenovo\\Practice Folder'

In [16]:
os.chdir('D:\Rohini Python\Working Directory')

In [17]:
df.to_csv('sales.csv') # my data frame converted into csv and it will be stored in current working directory
import os
os.getcwd()

'D:\\Rohini Python\\Working Directory'

In [18]:
data = pd.read_csv('sales.csv')

In [24]:
data.head()

   Unnamed: 0  TV ads  Car sold
0           0     1.0        14
1           1     3.0        24
2           2     2.0        19
3           3     1.0        13
4           4     3.0        24

In [4]:
import pandas as pd
data = pd.read_csv("Salaries.csv")

In [5]:
import numpy as np
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'c':[1,2,3]})

In [6]:
df

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.isna().sum()

A    1
B    2
c    0
dtype: int64

In [8]:
df.dropna()

     A    B  c
0  1.0  5.0  1

In [9]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [10]:
# thresh = 2 # keep only the rows with atleast two nan values 
df.dropna(thresh=2)

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2

In [11]:
df.dropna(thresh=3)

     A    B  c
0  1.0  5.0  1

In [12]:
df.fillna(0)

     A    B  c
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [13]:
df.fillna(1)

     A    B  c
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [14]:
df.fillna('b')

     A    B  c
0  1.0  5.0  1
1  2.0    b  2
2    b    b  3

In [15]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [16]:
data.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [20]:
data[['Benefits','BasePay']].fillna(data[['Benefits','BasePay']].mean())

            Benefits        BasePay
0       25007.893151  167411.180000
1       25007.893151  155966.020000
2       25007.893151  212739.130000
3       25007.893151   77916.000000
4       25007.893151  134401.600000
...              ...            ...
148649      0.000000       0.000000
148650  25007.893151   66325.448841
148651  25007.893151   66325.448841
148652  25007.893151   66325.448841
148653      0.000000       0.000000

[148654 rows x 2 columns]

In [21]:
data.fillna(0,inplace=True)

In [22]:
data['OvertimePay'].max()

245131.88

In [ ]:
what is the job title joseph driscoll,all caps

In [23]:
data[data['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [24]:
data[data['EmployeeName']=='JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,0.0,270324.91,270324.91,2011,0.0,San Francisco,0.0

In [ ]:
data['EmployeeName'][data[TotalPay]]

In [25]:
# how many unique job title are there?
data['JobTitle'].nunique()

2159

In [26]:
data['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [28]:
data['JobTitle'].value_counts()

Transit Operator                       7036
Special Nurse                          4389
Registered Nurse                       3736
Public Svc Aide-Public Works           2518
Police Officer 3                       2421
                                       ...
LIEUTENANT I, (POLICE DEPARTMENT)         1
ASSISTANT INDUSTRIAL HYGIENIST            1
DIRECTOR, JUVENILE HALL                   1
Public Service Aide-Technical             1
ASSISTANT SUPERINTENDENT RECREATION       1
Name: JobTitle, Length: 2159, dtype: int64

In [30]:
data['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [32]:
data['JobTitle'].value_counts().tail()

LIEUTENANT I, (POLICE DEPARTMENT)      1
ASSISTANT INDUSTRIAL HYGIENIST         1
DIRECTOR, JUVENILE HALL                1
Public Service Aide-Technical          1
ASSISTANT SUPERINTENDENT RECREATION    1
Name: JobTitle, dtype: int64

In [33]:
data

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011,0.0,San Francisco,0.0
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011,0.0,San Francisco,0.0
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011,0.0,San Francisco,0.0
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011,0.0,San Francisco,0.0
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011,0.0,San Francisco,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,0.0,San Francisco,0.0
148650,148651,Not provided,Not provided,0.00,0.00,0.00,0.0,0.00,0.00,2014,0.0,San Francisco,0.0
148651,148652,Not provided,Not provided,0.00,0.00,0.00,0.0,0.00,0.00,2014,0.0,San Francisco,0.0
148652,148653,Not provided,Not provided,0.00,0.00,0.00,0.0,0.00,0.00,2014,0.0,San Francisco,0.0
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,0.0,San Francisco,0.0

In [34]:
product=pd.DataFrame({
    'Product_ID':[101,102,103,104,105,106,107],
    'Product_name':['Watch','Bag','Shoes','Smartphone','Books','Oil','Laptop'],
    'Category':['Fashion','Fashion','Fashion','Electronics','Study','Grocery','Electronics'],
    'Price':[299.0,1350.50,2999.0,14999.0,145.0,110.0,79999.0],
    'Seller_City':['Delhi','Mumbai','Chennai','Kolkata','Delhi','Chennai','Bengalore']
})

In [35]:
customer=pd.DataFrame({
    'id':[1,2,3,4,5,6,7,8,9],
    'name':['Olivia','Aditya','Cory','Isabell','Dominic','Tyler','Samuel','Daniel','Jeremy'],
    'age':[20,25,15,10,30,65,35,18,23],
    'Product_ID':[101,0,106,0,103,104,0,0,107],
    'Purchased_Product':['Watch','NA','Oil','NA','Shoes','Smartphone','NA','NA','Laptop'],
    'City':['Mumbai','Delhi','Bangalore','Chennai','Chennai','Delhi','Kolkata','Delhi','Mumbai']
})

In [36]:
product

   Product_ID Product_name     Category    Price Seller_City
0         101        Watch      Fashion    299.0       Delhi
1         102          Bag      Fashion   1350.5      Mumbai
2         103        Shoes      Fashion   2999.0     Chennai
3         104   Smartphone  Electronics  14999.0     Kolkata
4         105        Books        Study    145.0       Delhi
5         106          Oil      Grocery    110.0     Chennai
6         107       Laptop  Electronics  79999.0   Bengalore

In [37]:
customer

   id     name  age  Product_ID Purchased_Product       City
0   1   Olivia   20         101             Watch     Mumbai
1   2   Aditya   25           0                NA      Delhi
2   3     Cory   15         106               Oil  Bangalore
3   4  Isabell   10           0                NA    Chennai
4   5  Dominic   30         103             Shoes    Chennai
5   6    Tyler   65         104        Smartphone      Delhi
6   7   Samuel   35           0                NA    Kolkata
7   8   Daniel   18           0                NA      Delhi
8   9   Jeremy   23         107            Laptop     Mumbai

In [39]:
pd.merge(product,customer,on='Product_ID')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

In [40]:
pd.merge(product,customer,on='Product_ID',how='left')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350.5,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999.0,Kolkata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai

In [41]:
pd.merge(product,customer,on='Product_ID',how='right')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,0,NaN,NaN,NaN,NaN,2,Aditya,25,NA,Delhi
2,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
3,0,NaN,NaN,NaN,NaN,4,Isabell,10,NA,Chennai
4,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
5,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
6,0,NaN,NaN,NaN,NaN,7,Samuel,35,NA,Kolkata
7,0,NaN,NaN,NaN,NaN,8,Daniel,18,NA,Delhi
8,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

In [42]:
pd.concat([product,customer],ignore_index=True)

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,NaN,NaN,NaN,NaN,NaN
1,102,Bag,Fashion,1350.5,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999.0,Chennai,NaN,NaN,NaN,NaN,NaN
3,104,Smartphone,Electronics,14999.0,Kolkata,NaN,NaN,NaN,NaN,NaN
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110.0,Chennai,NaN,NaN,NaN,NaN,NaN
6,107,Laptop,Electronics,79999.0,Bengalore,NaN,NaN,NaN,NaN,NaN
7,101,NaN,NaN,NaN,NaN,1.0,Olivia,20.0,Watch,Mumbai
8,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,NA,Delhi
9,106,NaN,NaN,NaN,NaN,3.0,Cory,15.0,Oil,Bangalore
10,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NA,Chennai
11,103,NaN,NaN,NaN,NaN,5.0,Dominic,30.0,Shoes,Chennai
12,104,NaN,NaN,NaN,NaN,6.0,Tyler,65.0,Smartphone,Delhi
13,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NA,Kolkata
14,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NA,Delhi
15,107,NaN,NaN,NaN,NaN,9.0,Jeremy,23.0,Laptop,Mumbai

In [43]:
df.to_csv('Salaries.csv') # my data frame converted into csv and it will be stored in current working directory
import os
os.getcwd()

'C:\\Users\\lenovo\\Practice Folder'